{
  "módulos": {
    "Fundamentos (Trivium & Quadrivium)": [
      {
        "pergunta": "Qual arte do Trivium é focada na estrutura da linguagem e no domínio dos fatos de um assunto?",
        "opcoes": ["Gramática", "Lógica", "Retórica", "Aritmética"],
        "resposta": "Gramática",
        "feedback": "A Gramática é a base para entender e expressar o conhecimento de forma clara."
      },
      {
        "pergunta": "A 'arte do pensamento correto', que ensina a construir argumentos válidos e a identificar falácias, é a...",
        "opcoes": ["Retórica", "Lógica", "Gramática", "Geometria"],
        "resposta": "Lógica",
        "feedback": "A Lógica (ou Dialética) é a ferramenta para organizar o pensamento e discernir a verdade."
      },
      {
        "pergunta": "Qual disciplina do Quadrivium era vista como 'o número em movimento', estudando a harmonia e as proporções no tempo?",
        "opcoes": ["Aritmética", "Geometria", "Música", "Astronomia"],
        "resposta": "Música",
        "feedback": "A Música, no Quadrivium, explorava as relações matemáticas que governam a harmonia."
      },
      {
        "pergunta": "Na Retórica, o apelo à emoção do público é conhecido como...",
        "opcoes": ["Logos", "Ethos", "Pathos", "Kairos"],
        "resposta": "Pathos",
        "feedback": "Pathos é um dos três pilares da persuasão aristotélica, ao lado de Logos (razão) e Ethos (caráter)."
      },
      {
        "pergunta": "O estudo dos corpos celestes e da ordem do cosmos, visto como 'a geometria em movimento', é a...",
        "opcoes": ["Aritmética", "Geometria", "Música", "Astronomia"],
        "resposta": "Astronomia",
        "feedback": "A Astronomia revelava a ordem divina e a beleza matemática do universo."
      },
      {
        "pergunta": "Qual arte do Trivium se concentra na persuasão e na comunicação eficaz, tanto escrita quanto falada?",
        "opcoes": ["Gramática", "Lógica", "Retórica", "Dialética"],
        "resposta": "Retórica",
        "feedback": "A Retórica é a arte de usar a linguagem de forma convincente e elegante."
      },
      {
        "pergunta": "A disciplina do Quadrivium que estuda o 'número em si', as propriedades dos números puros, é a...",
        "opcoes": ["Geometria", "Música", "Aritmética", "Astronomia"],
        "resposta": "Aritmética",
        "feedback": "A Aritmética era considerada a base para todas as outras ciências do Quadrivium."
      },
      {
        "pergunta": "Qual disciplina do Quadrivium era entendida como 'o número no espaço', estudando as formas e proporções estáticas?",
        "opcoes": ["Aritmética", "Música", "Geometria", "Astronomia"],
        "resposta": "Geometria",
        "feedback": "A Geometria revela a ordem e a harmonia na criação, fundamental para a arquitetura e a arte."
      }
    ],
    "As Virtudes": [
      {
        "pergunta": "Qual virtude cardeal nos dá a coragem para enfrentar dificuldades e perseverar na busca do bem?",
        "opcoes": ["Prudência", "Justiça", "Fortaleza", "Temperança"],
        "resposta": "Fortaleza",
        "feedback": "A Fortaleza nos capacita a superar o medo e a dor em busca do que é certo."
      },
      {
        "pergunta": "A virtude de dar a cada um o que lhe é devido, tanto a Deus quanto ao próximo, é a...",
        "opcoes": ["Prudência", "Justiça", "Fortaleza", "Temperança"],
        "resposta": "Justiça",
        "feedback": "A Justiça busca a equidade e a retidão nas relações."
      },
      {
        "pergunta": "Qual virtude teologal é a firme confiança na promessa da vida eterna com Deus?",
        "opcoes": ["Fé", "Esperança", "Caridade (Amor)", "Prudência"],
        "resposta": "Esperança",
        "feedback": "A Esperança nos sustenta na jornada da vida, com os olhos fixos no destino final."
      },
      {
        "pergunta": "A moderação dos apetites e o autocontrole sobre os prazeres sensoriais definem a virtude da...",
        "opcoes": ["Prudência", "Justiça", "Fortaleza", "Temperança"],
        "resposta": "Temperança",
        "feedback": "A Temperança nos ajuda a usar os bens criados com equilíbrio e moderação."
      },
      {
        "pergunta": "Qual virtude, chamada de 'a cocheira das virtudes', nos ajuda a discernir a ação correta em cada situação?",
        "opcoes": ["Justiça", "Fortaleza", "Temperança", "Prudência"],
        "resposta": "Prudência",
        "feedback": "A Prudência é a 'mãe' de todas as virtudes, pois guia a aplicação das outras."
      },
      {
        "pergunta": "Qual virtude teologal é a crença em Deus e em tudo o que Ele revelou?",
        "opcoes": ["Esperança", "Caridade (Amor)", "Fé", "Prudência"],
        "resposta": "Fé",
        "feedback": "A Fé é o fundamento da vida cristã, a adesão à verdade revelada."
      },
      {
        "pergunta": "Qual virtude teologal é descrita pelo Apóstolo Paulo em 1 Coríntios 13 como 'a maior de todas' e o vínculo da perfeição?",
        "opcoes": ["Fé", "Esperança", "Caridade (Amor)", "Justiça"],
        "resposta": "Caridade (Amor)",
        "feedback": "A Caridade é o amor a Deus sobre todas as coisas e ao próximo como a si mesmo por amor a Deus."
      }
    ],
    "Fontes e Pensadores": [
      {
        "pergunta": "Qual filósofo grego escreveu a 'Alegoria da Caverna' para ilustrar sua Teoria das Formas?",
        "opcoes": ["Aristóteles", "Sócrates", "Platão", "Heráclito"],
        "resposta": "Platão",
        "feedback": "A Alegoria da Caverna é uma das metáforas mais famosas da filosofia ocidental, presente em 'A República'."
      },
      {
        "pergunta": "Qual teólogo medieval é famoso por suas 'Cinco Vias', argumentos racionais para a existência de Deus?",
        "opcoes": ["Santo Agostinho", "Anselmo da Cantuária", "Tomás de Aquino", "Boécio"],
        "resposta": "Tomás de Aquino",
        "feedback": "As Cinco Vias de Tomás de Aquino são apresentadas em sua obra monumental, a 'Suma Teológica'."
      },
      {
        "pergunta": "Quem é o autor de 'A Consolação da Filosofia', obra escrita na prisão que influenciou todo o pensamento medieval?",
        "opcoes": ["Santo Agostinho", "São Jerônimo", "Boécio", "Cícero"],
        "resposta": "Boécio",
        "feedback": "'A Consolação da Filosofia' é um diálogo entre Boécio e a personificação da Filosofia."
      },
      {
        "pergunta": "Qual Pai da Igreja traduziu a Bíblia para o latim, criando a famosa versão conhecida como 'Vulgata'?",
        "opcoes": ["Santo Agostinho", "Santo Atanásio", "São Jerônimo", "Orígenes"],
        "resposta": "São Jerônimo",
        "feedback": "A Vulgata foi a versão oficial da Bíblia na Igreja Católica por séculos."
      },
      {
        "pergunta": "O sistema lógico de Aristóteles, fundamental para a Escolástica, foi compilado em uma coleção de obras chamada...",
        "opcoes": ["Metafísica", "Ética a Nicômaco", "Poética", "Organon"],
        "resposta": "Organon",
        "feedback": "O Organon de Aristóteles é a base da lógica formal ocidental."
      },
      {
        "pergunta": "Qual Pai da Igreja escreveu 'Confissões' e 'A Cidade de Deus', sendo uma figura central na união da fé cristã com a filosofia clássica?",
        "opcoes": ["Santo Ambrósio", "Santo Agostinho", "São Gregório Magno", "São Bento"],
        "resposta": "Santo Agostinho",
        "feedback": "Santo Agostinho é um dos mais importantes Padres da Igreja e Doutores da Igreja."
      },
      {
        "pergunta": "Qual filósofo grego, aluno de Platão, é conhecido por sua ênfase na observação empírica e por desenvolver o conceito das Quatro Causas?",
        "opcoes": ["Sócrates", "Platão", "Aristóteles", "Parmênides"],
        "resposta": "Aristóteles",
        "feedback": "Aristóteles foi um polímata, cujas obras abrangem diversas áreas do conhecimento."
      }
    ]
  }
}

